---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.GetSegmentDirection
source: html/55adcc5a-5ecc-0a77-c641-37e16c25bda0.htm
---
# Autodesk.Revit.DB.FillGrid.GetSegmentDirection Method

Provides the segment direction.

## Syntax (C#)
```csharp
public UV GetSegmentDirection()
```

## Returns
The direction of segment.